
## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/36298)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 7 to change, 1 to destroy.</code></pre>

* Create
  * null_resource.generate_appspec
* Update
  * aws_lambda_function.item_delete_sqs_processor
  * aws_lambda_function.item_update_backfill_sqs_processor
  * aws_lambda_function.item_update_sqs_processor
  * aws_lambda_function.unified_events_consumer
  * aws_lambda_function.user_list_events_sqs_processor
  * aws_lambda_function.user_list_import_backfill_sqs_processor
  * aws_lambda_function.user_list_import_sqs_processor
* Replace
  * aws_ecs_task_definition.queue_users


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.queue_users must be replaced
-/+ resource "aws_ecs_task_definition" "queue_users" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-QueueUsers:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ command                = [
                      - "npm",
                      + "pnpm",
                        "run",
                        # (1 unchanged element hidden)
                    ]
                  - cpu                    = 0
                  - mountPoints            = []
                    name                   = "node"
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
              ~ {
                  - cpu                    = 0
                  - environment            = []
                  - mountPoints            = []
                    name                   = "xray"
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "UserListSearch-Prod-QueueUsers" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      + skip_destroy             = false
        tags                     = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_lambda_function.item_delete_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_delete_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemDelete"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemDelete:205" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemDelete:205/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "205" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_LIST_IMPORT_BACKFILL_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.item_update_backfill_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_update_backfill_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemUpdateBackfill"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdateBackfill:294" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdateBackfill:294/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "294" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_LIST_IMPORT_BACKFILL_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.item_update_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_update_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemUpdate"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdate:299" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdate:299/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "299" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_LIST_IMPORT_BACKFILL_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.unified_events_consumer will be updated in-place
  ~ resource "aws_lambda_function" "unified_events_consumer" {
        id                             = "UserListSearch-Prod-UnifiedEventsConsumer"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UnifiedEventsConsumer:327" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UnifiedEventsConsumer:327/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "327" -> (known after apply)
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_LIST_IMPORT_BACKFILL_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill"
                # (14 unchanged elements hidden)
            }
        }

      - timeouts {}

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_events_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_events_sqs_processor" {
        id                             = "UserListSearch-Prod-EventHandler"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-EventHandler:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-EventHandler:35/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "35" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_LIST_IMPORT_BACKFILL_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_import_backfill_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_import_backfill_sqs_processor" {
        id                             = "UserListSearch-Prod-UserListImportBackfill"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImportBackfill:293" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImportBackfill:293/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "293" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_LIST_IMPORT_BACKFILL_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_import_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_import_sqs_processor" {
        id                             = "UserListSearch-Prod-UserListImport"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImport:291" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImport:291/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "291" -> (known after apply)
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_LIST_IMPORT_BACKFILL_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill"
                # (14 unchanged elements hidden)
            }
        }

      - timeouts {}

        # (3 unchanged blocks hidden)
    }

  # null_resource.generate_appspec will be created
  + resource "null_resource" "generate_appspec" {
      + id       = (known after apply)
      + triggers = {
          + "alb_container_name"  = "node"
          + "alb_container_port"  = "4000"
          + "task_definition_arn" = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:318"
        }
    }

Plan: 2 to add, 7 to change, 1 to destroy.

Changes to Outputs:
  ~ workspace = "Prod" -> "UserListSearch-Prod"
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"d487198e-601d-416e-b6b7-0f8d8750a9f5","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":139,"Program":"tfcmt","SHA1":"6ccc3867f9af2e27434afb4793208e0c7e2dbd28","Target":"user-list-search-cdk","Vars":{}} -->